In [167]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [103]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [104]:
flight_no=df['FlightNumber']
df.fillna(value=0,inplace=True)
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [105]:
f=list(flight_no)

In [42]:

f=list(flight_no)
for i in range(len(f)):
    if(f[i]==0):
        f[i]=f[i-1]+10

In [106]:
df['FlightNumber']=f

In [107]:
df.dtypes

FlightNumber    float64
RecentDelays     object
Airline          object
From             object
To               object
dtype: object

In [108]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [109]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    LoNDon      paris
1       10055.0            []    <Air France> (12)    MAdrid      miLAN
2       10065.0  [24, 43, 87]  (British Airways. )    londON  StockhOlm
3       10075.0          [13]       12. Air France  Budapest      PaRis
4       10085.0      [67, 32]          "Swiss Air"  Brussels     londOn

In [110]:
df['FlightNumber'].astype("Float64")

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [112]:
df['From_To']= ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn']
ft=df['From_To']

In [113]:
ft

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [151]:
l1=[]
l2=[]

def sp(a):
    z=a.split('_')
    l1.append(z[0])
    l2.append(z[1])
    
    
for i in list(ft):
    sp(i)

In [152]:
temp_df=pd.DataFrame([l1,l2],index=['From','To']).transpose()

In [153]:
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [154]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [134]:
def s(a):
    b=a.lower()
    c=a.capitalize()
    return c

In [143]:

temp_df['From']=temp_df['From'].apply(lambda z:z.capitalize())

temp_df['To']=temp_df['To'].apply(lambda z:z.capitalize())

In [144]:
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [149]:

df['From']=temp_df['From']
df['To']=temp_df['To']

In [150]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [162]:
s=df['RecentDelays']
s

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [212]:
delay1=[]
delay2=[]
delay3=[]
for i in s:
     
     if(len(i)==1):
        delay1.append(i[0])
        delay2.append(0)
        delay3.append(0)
     elif(len(i)==2):
        delay1.append(i[0])
        delay2.append(i[1])
        delay3.append(0)
     elif(len(i)==0):
        delay1.append(0)
        delay2.append(0)
        delay3.append(0)
     else:
        if(len(i)==3):
            delay1.append(i[0])
            delay2.append(i[1])
            delay3.append(i[2])

In [213]:
delay1

[23, 0, 24, 13, 67]

In [214]:
delay2

[47, 0, 43, 0, 32]

In [215]:
delay3

[0, 0, 87, 0, 0]

In [216]:
df.drop('RecentDelays',axis=1,inplace=True)

In [217]:
df

   FlightNumber              Airline      From         To
0       10045.0               KLM(!)    London      Paris
1       10055.0    <Air France> (12)    Madrid      Milan
2       10065.0  (British Airways. )    London  Stockholm
3       10075.0       12. Air France  Budapest      Paris
4       10085.0          "Swiss Air"  Brussels     London

In [218]:
df['delay1']=delay1
df['delay2']=delay2
df['delay3']=delay3

In [219]:
df

,FlightNumber,Airline,From,To,delay1,delay2,delay3
0,10045.0,KLM(!),London,Paris,23,47,0
1,10055.0,<Air France> (12),Madrid,Milan,0,0,0
2,10065.0,(British Airways. ),London,Stockholm,24,43,87
3,10075.0,12. Air France,Budapest,Paris,13,0,0
4,10085.0,"""Swiss Air""",Brussels,London,67,32,0

In [220]:
df.replace(0,np.nan)

,FlightNumber,Airline,From,To,delay1,delay2,delay3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN